#include <string.h>
#include <dolphin.h>

#include "functions.h"
#include "variables.h"

#include "load.h"

struct UnkStruct3
{
    u8 filler0[8];
};

struct UnkStruct1
{
    u32 unk0;
    char *unk4;
};

struct GMA
{
    u32 numModels;
    u8 *unk4;
    //u8 *unk8;
    struct UnkStruct1 *unk8;
    u32 unkC;
    u8 filler10[0x20-0x10];
    struct UnkStruct1 unk20;
};

char *lbl_802F12E8 = "Invalid Model";

// .sbss
float lbl_802F212C;
float lbl_802F2128;
GXColor lbl_802F2124;
u32 lbl_802F2120;
s32 lbl_802F211C;
GXColor lbl_802F2118;
s32 lbl_802F2114;
GXColor lbl_802F2110;
s32 lbl_802F210C;
s32 lbl_802F2108;
s32 lbl_802F2104;
u8 lbl_802F2101;
u8 lbl_802F2100;
float lbl_802F20FC;
float lbl_802F20F8;
float lbl_802F20F4;
typedef u32 (*Func802F20F0)();
Func802F20F0 lbl_802F20F0;
u32 lbl_802F20EC;
s32 lbl_802F20E8;
float lbl_802F20E4;
u32 lbl_802F20E0;
float lbl_802F20DC;
float lbl_802F20D8;
float lbl_802F20D4;
float lbl_802F20D0;
Mtx *lbl_802F20CC;
void **lbl_802F20C8;

struct Struct802B4ECC
{
    u8 unk0;  // 0x6c
    s8 unk1;
    u8 unk2;
    s8 unk3;
    s8 unk4;
    s8 unk5;
    u8 filler6[2];
    u32 unk8;
    u32 unkC;
    GXColor unk10;  // 0x7C
    GXColor unk14;
    u8 unk18;
    u8 unk19;
    u8 unk1A;
    u32 unk1C;
    u32 unk20;
    u32 unk24;
    u32 unk28;
    u32 unk2C;  // 0x98
    u32 unk30;  // 0x9C
    u32 unk34;  // 0xA0
    u32 unk38;  // 0xA4
    u16 unk3C;  // 0xA8
    u16 unk3E;  // 0xAA
    u16 unk40;  // 0xAC
    u32 unk44;  // 0xB0
    u32 unk48;  // 0xB4
    u32 unk4C;  // 0xB8
    u32 unk50;  // 0xBC
    u32 unk54;  // 0xC0
    Point3d unk58;
};

// .bss
Vec lbl_802B4E60;
Mtx lbl_802B4E6C;
Mtx lbl_802B4E9C;
struct Struct802B4ECC lbl_802B4ECC;
u8 lbl_802B4F30[0x30];
u8 lbl_802B4F60[0x20];  //802B4F60
u8 lbl_802B4F80[0x20];
u8 lbl_802B4FA0[0x20];
//struct Struct802B4F60 lbl_802B4F60;

FORCE_BSS_ORDER(lbl_802B4E60)
FORCE_BSS_ORDER(lbl_802B4E6C)
FORCE_BSS_ORDER(lbl_802B4E9C)
FORCE_BSS_ORDER(lbl_802B4ECC)
FORCE_BSS_ORDER(lbl_802B4F30)
FORCE_BSS_ORDER(lbl_802B4F60)
FORCE_BSS_ORDER(lbl_802B4F80)
FORCE_BSS_ORDER(lbl_802B4FA0)

extern void func_8008E5B8(float, float, float);
extern void func_8008F714(float, float, float, float);
extern void func_8008F7C8(float, float, float, float);
extern void func_8008F880(int, float, float);
extern void mathutil_set_a_mtx_translate(float, float, float);

void func_8008E574(Vec *a);
void func_8008E5C8(u8 a, u32 b, u8 c);

asm void func_8008D6BC(register u32 arg)
{
    nofralloc
    lis r5, GXWGFifo@h
    li r4, 0x61
    ori r5, r5, GXWGFifo@l
