/**
 * memcard.c - Implements memory card loading and saving functionality
 */
#include <math.h>
#include <stddef.h>
#include <stdio.h>
#include <string.h>
#include <dolphin.h>

#include "global.h"
#include "course.h"
#include "event.h"
#include "input.h"
#include "mathutil.h"
#include "mode.h"
#include "sprite.h"

struct StringEntry
{
    char *str;
    u32 unk4;
};

struct MemCardMessage
{
    struct StringEntry *lines;
    int numLines;
};

enum
{
    MC_STATUS_MOUNTED = (1 << 0),
    MC_STATUS_OPEN    = (1 << 1),
    MC_STATUS_SAVING  = (1 << 4),  // saving gamedata or replay
    MC_STATUS_LOADING = (1 << 5),  // loading gamdata or replay
    MC_STATUS_ERROR   = (1 << 9),
    MC_STATUS_REPLAY_FILE  = (1 << 12),  // loading/saving/deleting replay
    MC_STATUS_GAMEDATA_FILE = (1 << 13),  // loading/saving gamedata
    MC_STATUS_WRITE_IN_PROGRESS = (1 << 21),
};

enum
{
    /*0*/ MC_MODE_LOAD_GAMEDATA_0,
    /*1*/ MC_MODE_SAVE_GAMEDATA_1,
    /*2*/ MC_MODE_LOAD_GAMEDATA_2,
    /*3*/ MC_MODE_SAVE_GAMEDATA_3,
    /*4*/ MC_MODE_LOAD_REPLAY,
    /*5*/ MC_MODE_SAVE_REPLAY,
    /*6*/ MC_MODE_LIST_REPLAY,
    /*7*/ MC_MODE_DELETE_REPLAY,
};

enum
{
    MC_STATE_UNK1 = 1,
    MC_STATE_PROBE = 2,
    MC_STATE_MOUNT = 3,
    MC_STATE_CHECK_MOUNT_RESULT = 4,
    MC_STATE_VERIFY_FILESYSTEM = 5,
    MC_STATE_CHECK_VERIFY_FILESYSTEM_RESULT = 6,
    MC_STATE_OPEN_FILE = 8,
    MC_STATE_FORMAT_PROMPT = 9,
    MC_STATE_OVERWRITE_PROMPT = 13,
    MC_STATE_CHECK_CREATE_FILE_RESULT = 14,
    MC_STATE_GET_METADATA = 20,
    MC_STATE_CHECK_FREE_SPACE = 23,
    MC_STATE_CHECK_FREE_SPACE2 = 30,
    MC_STATE_ERROR = 0xFF,
};

// .bss
CARDStat cardStat;
struct MemcardInfo
{
    s32 fileNo;
    /*0x04*/ s32 sectorSize;
    /*0x08*/ u32 statusFlags;
    /*0x0C*/ struct MemCardMessage *msg;
    u8 unused10[4];
    /*0x14*/ char fileName[0x38-0x14];
    /*0x38*/ OSTime time;
    s16 unk40;
    u16 unk42;  // error message timer?
    u32 unk44;
    /*0x48*/ u32 fileSize;
    /*0x4C*/ u8 state;
    u8 unk4D;
    /*0x50*/ CARDFileInfo cardFileInfo;
    u8 unused64[0xC];
} memcardInfo;
u8 cardWorkArea[0xA100];
struct MemcardGameData_sub lbl_802C4480;
char strFmtBufferLine1[64];
char strFmtBufferLine2[64];
char strFmtBufferLine3[64];
char lbl_802C4900[64];

FORCE_BSS_ORDER(cardStat)
FORCE_BSS_ORDER(memcardInfo)
FORCE_BSS_ORDER(cardWorkArea)
FORCE_BSS_ORDER(lbl_802C4480)
FORCE_BSS_ORDER(strFmtBufferLine1)
FORCE_BSS_ORDER(strFmtBufferLine2)
FORCE_BSS_ORDER(strFmtBufferLine3)
FORCE_BSS_ORDER(lbl_802C4900)

u8 lbl_802F21C8;

// replay file data
struct
{
    u16 crc;
    u16 replayFlags;
    u8 unk4;
    u8 difficulty;
    u8 floorNum;
    u8 unk7;
    u32 unk8;
    u32 unkC;
    /*0x0010*/ u8 bannerImg[0x1800];
    /*0x1810*/ u8 replayIcon[0x800];
    /*0x2010*/ char comment[0x20];  // "Super Monkey Ball"
    char unk2030[0x20];
    u8 unk2050[100];
} *memcardReplayData;

u32 lbl_802F21C0;
struct ReplayFileInfo
{
    u8 filler0[2];
    u16 replayFlags;
    u8 unk4;
    u8 difficulty;
    u8 floorNum;
    u8 unk7;
    u32 unk8;
    u32 unkC;
    u32 fileSize;
    s8 fileNo;
} *replayFileInfo;
u8 lbl_802F21B9;
u8 replayFileIndex;
u32 lbl_802F21B4;
s8 lbl_802F21B2;
u8 lbl_802F21B1;

u8 memcardMode;
struct MemcardGameData *memcardGameData;
u8 lbl_802F21A8;

#define BLOCK_SIZE 0x2000

#pragma force_active on

void func_8009F49C(int mode)
{
    memcardMode = mode;
}

int memcard_is_write_in_progress(void)
{
    return (memcardInfo.statusFlags & MC_STATUS_WRITE_IN_PROGRESS);
}

void func_8009F4B8(struct ReplayFileInfo *replay, u32 b)
{
    replayFileInfo = replay;
    lbl_802F21C0 = b;
}

u8 func_8009F4C4(void)
{
    return lbl_802F21A8;
}

void func_8009F4CC(u8 a)
{
    lbl_802F21A8 = a;
}

void memcard_cancel_and_unmount(void)
{
