#include <math.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <dolphin.h>

#include "global.h"
#include "ball.h"
#include "camera.h"
#include "gma.h"
#include "gxutil.h"
#include "load.h"
#include "mathutil.h"
#include "mode.h"
#include "nl2ngc.h"
#include "ord_tbl.h"
#include "light.h"

struct Struct80089A04
{
    u8 filler0[4];
    char *unk4[11];
    s32 unk30[4];
};

struct Ape_child lbl_801C7A70 =
{
    0.0f,
    0,
    0,
    0,
    1,
    0,
    1.0f,
    0,
};

u32 lbl_801C7A90[] = { 1, 5, 7, 8, 12, 13, 16, 18, 19, 21, 22, 23, 24, 26, 27 };

// yaw angles for something?
float lbl_801C7ACC[] = { 23.0f, 21.1f, 22.0f, 21.5f };

u32 lbl_801C7ADC[] = { 16, 8, 32, 6, 9, 16 };
u32 lbl_801C7AF4[] = { 24, 4, 6, 4, 14, 20, 24, 30, 20, 20 };
s32 lbl_801C7B1C[] = { 0, 4, 6, 14, 6, 10 };

void ape_dummy_1(struct Ape *);
void ape_dummy_2(struct Ape *);
void ape_dummy_3(struct Ape *);
void ape_dummy_4(struct Ape *);

// none of these functions actually do anything
void (*apeDummyFuncs[])(struct Ape *) =
{
    ape_dummy_1,
    ape_dummy_2,
    ape_dummy_3,
    ape_dummy_4,
    ape_dummy_4,
    ape_dummy_4,
    ape_dummy_4,
    ape_dummy_4,
    ape_dummy_4,
    ape_dummy_4,
};

// bss
Mtx lbl_802B39C0;
u32 lbl_802B39C0_30[0x20];
struct Ape apeStructs[16];  // B0
struct Ape *apeStructPtrs[16];  // CF0

FORCE_BSS_ORDER(lbl_802B39C0)
FORCE_BSS_ORDER(lbl_802B39C0_30)
FORCE_BSS_ORDER(apeStructs)
FORCE_BSS_ORDER(apeStructPtrs)

struct GMA *charaGMAs[8];  // D30
struct TPL *charaTPLs[8];  // D50
u32 charaTplSizes[8];  // D70
u32 charaTplAramAddrs[8];  // D90
u32 charaGmaSizes[8];  // DB0
u32 charaGmaAramAddrs[8];  // DD0
u32 lbl_802B47B0[4];  // DF0
u32 lbl_802B47C0[4];  // E00
struct TPL *lbl_802B47D0[4];  // E10
GXTexObj *lbl_802B47E0[4];  // E20
struct GMAShape *lbl_802B47F0[4];  // E30
struct GMATevLayer *lbl_802B4800[8];  // E40
Mtx lbl_802B4820;  // E60
Mtx lbl_802B4850[15];  // E90
u8 lbl_802B4B20[0x2D0];
GXTexObj *lbl_802B4DF0[8];

u32 *motLabel;
s32 lbl_802F20AC;
struct MotSkeleton *motSkeleton;
struct MotInfo *motInfo;
u8 lbl_802F209C[8];
u8 lbl_802F2094[8];
int lbl_802F2090;
u8 lbl_802F208C;
void **lbl_802F2088;
struct NaomiObj *apeFaceObj;
struct TPL *apeFaceTpl;
s32 lbl_802F207C;
float lbl_802F2078;
s8 lbl_802F2074;
volatile int transferInProgress;
s32 lbl_802F206C;
u32 nextApeIndex;

static void aram_transfer_callback(u32 a)
{
    transferInProgress = FALSE;
}

void load_character_resources(void)
{
    OSHeapHandle oldHeap;
    ARQRequest arqReq;
    struct File file;
    char filename[0x100];
    char *charaNames[] =
    {
        "BOY H",  // why no underscore here?
        "BOY_L",
        "GAL_H",
        "GAL_L",
        "KID_H",
        "KID_L",
        "GOR_H",
        "GOR_L",
    };
    char *sp8[] =
    {
        "boy_ch.tpl.lz",
        NULL,
        "kid_ch.tpl.lz",
        "gor_ch.tpl.lz",
    };
    void *work;
