#include <math.h>
#include <stddef.h>
#include <stdint.h>
#include <stdio.h>
#include <string.h>
#include <dolphin.h>

#include "global.h"
#include "load.h"
#include "mathutil.h"
#include "mode.h"
#include "nl2ngc.h"

struct UnkMotApe1
{
    u32 unk0;
    u8 filler4[0x28-0x4];
    u16 unk28;
    u16 unk2A;
    u16 unk2C;
    u16 unk2E;
    u8 filler30[2];
    u16 unk32;
    u16 unk34;
    u16 unk36;
    u16 unk38;
    u8 filler3A[2];
    float unk3C;
    float unk40;
    u8 filler44[0xC200-0x44];
};

extern s8 lbl_802F2074;

u32 lbl_801C7A70[] =
{
    0,
    0,
    0,
    0,
    1,
    0,
    0x3F800000,
    0,
};

u32 lbl_801C7A90[] =
{
    0x00000001,
    0x00000005,
    0x00000007,
    0x00000008,
    0x0000000C,
    0x0000000D,
    0x00000010,
    0x00000012,
    0x00000013,
    0x00000015,
    0x00000016,
    0x00000017,
    0x00000018,
    0x0000001A,
    0x0000001B,
};

u32 lbl_801C7ACC[] =
{
    0x41B80000,
    0x41A8CCCD,
    0x41B00000,
    0x41AC0000,
};

u32 lbl_801C7ADC[] =
{
    0x00000010,
    0x00000008,
    0x00000020,
    0x00000006,
    0x00000009,
    0x00000010,
    0x00000018,
    0x00000004,
    0x00000006,
    0x00000004,
    0x0000000E,
    0x00000014,
    0x00000018,
    0x0000001E,
    0x00000014,
    0x00000014,
};

u32 lbl_801C7B1C[] =
{
    0,
    0x00000004,
    0x00000006,
    0x0000000E,
    0x00000006,
    0x0000000A,
};

void func_8008A114(int);
void func_8008A118(int);
void func_8008A11C(int);
void func_8008A120(int);

void (*lbl_801C7B34[])(int) =
{
    func_8008A114,
    func_8008A118,
    func_8008A11C,
    func_8008A120,
    func_8008A120,
    func_8008A120,
    func_8008A120,
    func_8008A120,
    func_8008A120,
    func_8008A120,
};

#define lbl_801C7B8C "mot_ape.c"

struct Struct80089A04_1_child_sub
{
    char *unk0;
    u8 filler4[0x20-0x4];
};  // size = 0x20

struct Struct80089A04_1_child
{
    u8 filler0[0x14];
    struct Struct80089A04_1_child_sub unk14[2];
};

struct Struct80089A04_1
{
    u8 filler0[4];
    struct Struct80089A04_1_child *unk4[4];
    s16 unk14[8];
};  // size = 0x24

struct Struct80089A04
{
    u8 filler0[4];
    char *unk4[11];
    s32 unk30[11];
};

struct Struct802B39C0_B0_child
{
    u32 unk0;
    float unk4;
    u32 unk8;
    u32 unkC;
    float unk10;
    u32 unk14[3];  // hmm
    //u8 filler14[0x20-0x14];
    u32 unk20;
};  // size = 0x24

struct Struct802B39C0_B0  // probably Ape
{
    struct Struct800355B8 *unk0;
    struct Struct800355B8 *unk4;
    float unk8;
    float unkC;
    u32 unk10;
    u32 unk14;
    u32 unk18;
    void *unk1C;
    u32 unk20;
    u32 unk24;
    u32 unk28;
    void *unk2C;
    Vec unk30;
    Vec unk3C;
    Vec unk48;
    u32 unk54;
    float unk58;
    u32 unk5C;
    Quaternion unk60;
    u32 unk70;
    u8 filler74[0x90-0x74];
    u32 unk90;
    u32 unk94;  // count of unk98
    struct Struct802B39C0_B0_child *unk98;
    u32 unk9C;
    Quaternion unkA0;
    u32 unkB0;
    u32 unkB4;
    void *unkB8;
    void *unkBC;
    u8 fillerC0[4];
};  // size = 0xC4

// bss
u8 lbl_802B39C0[0x30];
u32 lbl_802B39C0_30[0x20];
struct Struct802B39C0_B0 lbl_802B39C0_B0[16];  // B0
void *lbl_802B46B0[16];  // CF0

FORCE_BSS_ORDER(lbl_802B39C0)
FORCE_BSS_ORDER(lbl_802B39C0_30)
FORCE_BSS_ORDER(lbl_802B39C0_B0)
FORCE_BSS_ORDER(lbl_802B46B0)

struct GMA *charaGMAs[8];  // D30
struct TPL *charaTPLs[8];  // D50
u32 charaTplSizes[8];  // D70
u32 charaTplAramSizes[8];  // D90
u32 charaGmaSizes[8];  // DB0
u32 charaGmaAramSizes[8];  // DD0
u32 lbl_802B47B0[4];  // DF0
u32 lbl_802B47C0[4];  // E00
struct TPL *lbl_802B47D0[4];  // E10
GXTexObj *lbl_802B47E0[4];  // E20
struct GMAMeshHeader *lbl_802B47F0[4];  // E30
u32 lbl_802B4800[8];  // E40
Mtx lbl_802B4820;  // E60

extern u8 lbl_802F209C[8];
extern u8 lbl_802F2094[8];
extern u8 lbl_802F208C;
extern int lbl_802F2090;
extern volatile int lbl_802F2070;

struct Struct801C7824
{
    char *unk0;
    u8 filler4[0x1C-0x4];
    s16 unk1C[2];
    u8 filler20[4];
};  // size = 0x24

extern struct Struct801C7824 lbl_801C7824[];

void lbl_800893DC(u32 a)
{
    lbl_802F2070 = 0;
}

void func_800893E8(void)
{
    OSHeapHandle oldHeap;
    ARQRequest arqReq;
    struct File file;
    char filename[0x100];
    char *charaNames[] =
    {
        "BOY H",  // why no underscore here?
        "BOY_L",
        "GAL_H",
        "GAL_L",
        "KID_H",
        "KID_L",
        "GOR_H",
        "GOR_L",
    };
    char *sp8[] =
    {
        "boy_ch.tpl.lz",
        NULL,
        "kid_ch.tpl.lz",
        "gor_ch.tpl.lz",
    };
    void *work;
    u32 aramTop = 0xFF0000;
    char *suffix;
    int baseLen;
    void *compressed;
    u32 i;
    u32 j;

    DVDChangeDir("ape");
