#include <dolphin.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "global.h"
#include "ball.h"
#include "bitmap.h"
#include "camera.h"
#include "effect.h"
#include "event.h"
#include "gma.h"
#include "info.h"
#include "input.h"
#include "mathutil.h"
#include "mode.h"
#include "pool.h"
#include "ranking_screen.h"
#include "recplay.h"
#include "sound.h"
#include "sprite.h"
#include "stage.h"
#include "stcoli.h"
#include "stobj.h"

#define NUM_BUTTONS 48

struct Struct802C6220 lbl_802C6220;
FORCE_BSS_ORDER(lbl_802C6220)

static struct GMAModel *s_buttonModels[NUM_BUTTONS];  // 0xF4
FORCE_BSS_ORDER(s_buttonModels)

struct Struct802C63D4
{
    s8 unk0;
    u8 filler1[3];
    s32 unk4;
    float unk8[3];
};  // size = 0x14

struct Struct802C63D4 lbl_802C63D4[NUM_BUTTONS];  // 0x1B4
FORCE_BSS_ORDER(lbl_802C63D4)

struct
{
    s32 unk0;  // 0x574
    s32 unk4;  // 0x578
    s32 unk8;  // 0x57C
    char unkC[4];  // 0x580
    s32 unk10;  // 0x584
    s32 unk14;  // 0x588
    float unk18;  // 0x58C
    float unk1C;  // 0x590
    float unk20;
    float unk24;
    float unk28;  // 0x59C
    float unk2C;  // 0x5A0
    float unk30;
    float unk34;  // 0x5A8
    float unk38;
    float unk3C;  // 0x5B0
} lbl_802C6794;
FORCE_BSS_ORDER(lbl_802C6794)


struct ScoreRecord lbl_802C67D4[4][5];  // 0x5B4
FORCE_BSS_ORDER(lbl_802C67D4)

void func_800AD38C(void)
{
    func_800AEBA8();
}

static u8 s_buttonLetters[NUM_BUTTONS] =
{
    0,   0,   ' ', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I',
    'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U',
    'V', 'W', 'X', 'Y', 'Z', '!', '&', '-', '.', '?', '@', '9',
    '8', '7', '6', '5', '4', '3', '2', '1', '0', '\b', 0,  0,
};

static char *s_buttonModelNames[NUM_BUTTONS] =
{
    NULL,
    NULL,
    "FONT_ARROW_R",
    "FONT_A",
    "FONT_B",
    "FONT_C",
    "FONT_D",
    "FONT_E",
    "FONT_F",
    "FONT_G",
    "FONT_H",
    "FONT_I",
    "FONT_J",
    "FONT_K",
    "FONT_L",
    "FONT_M",
    "FONT_N",
    "FONT_O",
    "FONT_P",
    "FONT_Q",
    "FONT_R",
    "FONT_S",
    "FONT_T",
    "FONT_U",
    "FONT_V",
    "FONT_W",
    "FONT_X",
    "FONT_Y",
    "FONT_Z",
    "FONT_EXCLAM",
    "FONT_AMPERSAND",
    "FONT_MINUS",
    "FONT_PERIOD",
    "FONT_QUESTION",
